RT-Thread/rt-thread/bsp/hc32/ev_hc32f4a8_lqfp176/board/board_config.h
/*
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2022-04-28     CDT          first version
 */


#ifndef __BOARD_CONFIG_H__
#define __BOARD_CONFIG_H__

#include <rtconfig.h>
#include "hc32_ll.h"
#include "drv_config.h"


/************************* XTAL port **********************/
#define XTAL_PORT                       (GPIO_PORT_H)
#define XTAL_IN_PIN                     (GPIO_PIN_01)
#define XTAL_OUT_PIN                    (GPIO_PIN_00)

/************************ USART port **********************/
#if defined(BSP_USING_UART1)
    #define USART1_RX_PORT                  (GPIO_PORT_H)
    #define USART1_RX_PIN                   (GPIO_PIN_13)
    #define USART1_RX_FUNC                  (GPIO_FUNC_33)

    #define USART1_TX_PORT                  (GPIO_PORT_H)
    #define USART1_TX_PIN                   (GPIO_PIN_15)
    #define USART1_TX_FUNC                  (GPIO_FUNC_32)
#endif

#if defined(BSP_USING_UART6)
    #define USART6_RX_PORT                  (GPIO_PORT_D)
    #define USART6_RX_PIN                   (GPIO_PIN_06)
    #define USART6_RX_FUNC                  (GPIO_FUNC_37)

    #define USART6_TX_PORT                  (GPIO_PORT_E)
    #define USART6_TX_PIN                   (GPIO_PIN_06)
    #define USART6_TX_FUNC                  (GPIO_FUNC_36)
#endif

/************************ I2C port **********************/
#if defined(BSP_USING_I2C1)
    #define I2C1_SDA_PORT                   (GPIO_PORT_F)
    #define I2C1_SDA_PIN                    (GPIO_PIN_10)
    #define I2C1_SDA_FUNC                   (GPIO_FUNC_48)

    #define I2C1_SCL_PORT                   (GPIO_PORT_D)
    #define I2C1_SCL_PIN                    (GPIO_PIN_03)
    #define I2C1_SCL_FUNC                   (GPIO_FUNC_49)
#endif

/***********  ADC configure *********/
#if defined(BSP_USING_ADC1)
    #define ADC1_CH_PORT                    (GPIO_PORT_C)   /* Default ADC123_IN10 */
    #define ADC1_CH_PIN                     (GPIO_PIN_00)
#endif

#if defined(BSP_USING_ADC2)
    #define ADC2_CH_PORT                    (GPIO_PORT_C)   /* Default ADC123_IN11 */
    #define ADC2_CH_PIN                     (GPIO_PIN_01)
#endif

#if defined(BSP_USING_ADC3)
    #define ADC3_CH_PORT                    (GPIO_PORT_C)   /* Default ADC123_IN12 */
    #define ADC3_CH_PIN                     (GPIO_PIN_02)
#endif

/***********  DAC configure *********/
#if defined(BSP_USING_DAC1)
    #define DAC1_CH1_PORT                   (GPIO_PORT_A)
    #define DAC1_CH1_PIN                    (GPIO_PIN_04)
    #define DAC1_CH2_PORT                   (GPIO_PORT_A)
    #define DAC1_CH2_PIN                    (GPIO_PIN_05)
#endif

#if defined(BSP_USING_DAC2)
    #define DAC2_CH1_PORT                   (GPIO_PORT_C)
    #define DAC2_CH1_PIN                    (GPIO_PIN_04)
    #define DAC2_CH2_PORT                   (GPIO_PORT_C)
    #define DAC2_CH2_PIN                    (GPIO_PIN_05)
#endif

/***********  CAN/MCAN configure *********/
#if defined(BSP_USING_CAN1)
    #define CAN1_TX_PORT                    (GPIO_PORT_I)
    #define CAN1_TX_PIN                     (GPIO_PIN_12)
    #define CAN1_TX_PIN_FUNC                (GPIO_FUNC_60)

    #define CAN1_RX_PORT                    (GPIO_PORT_G)
    #define CAN1_RX_PIN                     (GPIO_PIN_07)
    #define CAN1_RX_PIN_FUNC                (GPIO_FUNC_61)
#endif

#if defined(BSP_USING_CAN2)
    #define CAN2_TX_PORT                    (GPIO_PORT_G)
    #define CAN2_TX_PIN                     (GPIO_PIN_09)
    #define CAN2_TX_PIN_FUNC                (GPIO_FUNC_62)

    #define CAN2_RX_PORT                    (GPIO_PORT_I)
    #define CAN2_RX_PIN                     (GPIO_PIN_03)
    #define CAN2_RX_PIN_FUNC                (GPIO_FUNC_63)
#endif

#if defined(BSP_USING_MCAN1)
    #define MCAN1_TX_PORT                   (GPIO_PORT_I)
    #define MCAN1_TX_PIN                    (GPIO_PIN_12)
    #define MCAN1_TX_PIN_FUNC               (GPIO_FUNC_28)

    #define MCAN1_RX_PORT                   (GPIO_PORT_G)
    #define MCAN1_RX_PIN                    (GPIO_PIN_07)
    #define MCAN1_RX_PIN_FUNC               (GPIO_FUNC_29)
#endif

#if defined(BSP_USING_MCAN2)
    #define MCAN2_TX_PORT                   (GPIO_PORT_G)
    #define MCAN2_TX_PIN                    (GPIO_PIN_09)
    #define MCAN2_TX_PIN_FUNC               (GPIO_FUNC_30)

    #define MCAN2_RX_PORT                   (GPIO_PORT_I)
    #define MCAN2_RX_PIN                    (GPIO_PIN_03)
    #define MCAN2_RX_PIN_FUNC               (GPIO_FUNC_31)
#endif

/************************* SPI port ***********************/
#if defined(BSP_USING_SPI1)
    #define SPI1_CS_PORT                (GPIO_PORT_C)
    #define SPI1_CS_PIN                 (GPIO_PIN_07)

    #define SPI1_SCK_PORT               (GPIO_PORT_C)
    #define SPI1_SCK_PIN                (GPIO_PIN_06)
    #define SPI1_SCK_FUNC               (GPIO_FUNC_40)

    #define SPI1_MOSI_PORT              (GPIO_PORT_B)
    #define SPI1_MOSI_PIN               (GPIO_PIN_13)
    #define SPI1_MOSI_FUNC              (GPIO_FUNC_41)

    #define SPI1_MISO_PORT              (GPIO_PORT_B)
    #define SPI1_MISO_PIN               (GPIO_PIN_12)
    #define SPI1_MISO_FUNC              (GPIO_FUNC_42)

    #define SPI1_WP_PORT                (GPIO_PORT_B)
    #define SPI1_WP_PIN                 (GPIO_PIN_10)

    #define SPI1_HOLD_PORT              (GPIO_PORT_B)
    #define SPI1_HOLD_PIN               (GPIO_PIN_02)
#endif

/************************* ETH port ***********************/

#if defined(BSP_USING_ETH)
    #if defined(ETH_INTERFACE_USING_RMII)
        #define ETH_SMI_MDIO_PORT       (GPIO_PORT_A)
        #define ETH_SMI_MDIO_PIN        (GPIO_PIN_02)
        #define ETH_SMI_MDIO_FUNC       (GPIO_FUNC_11)

        #define ETH_SMI_MDC_PORT        (GPIO_PORT_C)
        #define ETH_SMI_MDC_PIN         (GPIO_PIN_01)
        #define ETH_SMI_MDC_FUNC        (GPIO_FUNC_11)

        #define ETH_RMII_TX_EN_PORT     (GPIO_PORT_G)
        #define ETH_RMII_TX_EN_PIN      (GPIO_PIN_11)
        #define ETH_RMII_TX_EN_FUNC     (GPIO_FUNC_11)

        #define ETH_RMII_TXD0_PORT      (GPIO_PORT_G)
        #define ETH_RMII_TXD0_PIN       (GPIO_PIN_13)
        #define ETH_RMII_TXD0_FUNC      (GPIO_FUNC_11)

        #define ETH_RMII_TXD1_PORT      (GPIO_PORT_G)
        #define ETH_RMII_TXD1_PIN       (GPIO_PIN_14)
        #define ETH_RMII_TXD1_FUNC      (GPIO_FUNC_11)

        #define ETH_RMII_REF_CLK_PORT   (GPIO_PORT_A)
        #define ETH_RMII_REF_CLK_PIN    (GPIO_PIN_01)
        #define ETH_RMII_REF_CLK_FUNC   (GPIO_FUNC_11)

        #define ETH_RMII_CRS_DV_PORT    (GPIO_PORT_A)
        #define ETH_RMII_CRS_DV_PIN     (GPIO_PIN_07)
        #define ETH_RMII_CRS_DV_FUNC    (GPIO_FUNC_11)

        #define ETH_RMII_RXD0_PORT      (GPIO_PORT_C)
        #define ETH_RMII_RXD0_PIN       (GPIO_PIN_04)
        #define ETH_RMII_RXD0_FUNC      (GPIO_FUNC_11)

        #define ETH_RMII_RXD1_PORT      (GPIO_PORT_C)
        #define ETH_RMII_RXD1_PIN       (GPIO_PIN_05)
        #define ETH_RMII_RXD1_FUNC      (GPIO_FUNC_11)
    #else
        #define ETH_SMI_MDIO_PORT       (GPIO_PORT_A)
        #define ETH_SMI_MDIO_PIN        (GPIO_PIN_02)
        #define ETH_SMI_MDIO_FUNC       (GPIO_FUNC_11)

        #define ETH_SMI_MDC_PORT        (GPIO_PORT_C)
        #define ETH_SMI_MDC_PIN         (GPIO_PIN_01)
        #define ETH_SMI_MDC_FUNC        (GPIO_FUNC_11)

