RT-Thread/rt-thread/bsp/hc32/ev_hc32f4a8_lqfp176/board/board_config.h
        #define ETH_MII_TX_CLK_PORT     (GPIO_PORT_B)
        #define ETH_MII_TX_CLK_PIN      (GPIO_PIN_06)
        #define ETH_MII_TX_CLK_FUNC     (GPIO_FUNC_11)

        #define ETH_MII_TX_EN_PORT      (GPIO_PORT_G)
        #define ETH_MII_TX_EN_PIN       (GPIO_PIN_11)
        #define ETH_MII_TX_EN_FUNC      (GPIO_FUNC_11)

        #define ETH_MII_TXD0_PORT       (GPIO_PORT_G)
        #define ETH_MII_TXD0_PIN        (GPIO_PIN_13)
        #define ETH_MII_TXD0_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_TXD1_PORT       (GPIO_PORT_G)
        #define ETH_MII_TXD1_PIN        (GPIO_PIN_14)
        #define ETH_MII_TXD1_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_TXD2_PORT       (GPIO_PORT_B)
        #define ETH_MII_TXD2_PIN        (GPIO_PIN_09)
        #define ETH_MII_TXD2_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_TXD3_PORT       (GPIO_PORT_B)
        #define ETH_MII_TXD3_PIN        (GPIO_PIN_08)
        #define ETH_MII_TXD3_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RX_CLK_PORT     (GPIO_PORT_A)
        #define ETH_MII_RX_CLK_PIN      (GPIO_PIN_01)
        #define ETH_MII_RX_CLK_FUNC     (GPIO_FUNC_11)

        #define ETH_MII_RX_DV_PORT      (GPIO_PORT_A)
        #define ETH_MII_RX_DV_PIN       (GPIO_PIN_07)
        #define ETH_MII_RX_DV_FUNC      (GPIO_FUNC_11)

        #define ETH_MII_RXD0_PORT       (GPIO_PORT_C)
        #define ETH_MII_RXD0_PIN        (GPIO_PIN_04)
        #define ETH_MII_RXD0_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RXD1_PORT       (GPIO_PORT_C)
        #define ETH_MII_RXD1_PIN        (GPIO_PIN_05)
        #define ETH_MII_RXD1_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RXD2_PORT       (GPIO_PORT_B)
        #define ETH_MII_RXD2_PIN        (GPIO_PIN_00)
        #define ETH_MII_RXD2_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RXD3_PORT       (GPIO_PORT_B)
        #define ETH_MII_RXD3_PIN        (GPIO_PIN_01)
        #define ETH_MII_RXD3_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RX_ER_PORT      (GPIO_PORT_I)
        #define ETH_MII_RX_ER_PIN       (GPIO_PIN_10)
        #define ETH_MII_RX_ER_FUNC      (GPIO_FUNC_11)

        #define ETH_MII_CRS_PORT        (GPIO_PORT_H)
        #define ETH_MII_CRS_PIN         (GPIO_PIN_02)
        #define ETH_MII_CRS_FUNC        (GPIO_FUNC_11)

        #define ETH_MII_COL_PORT        (GPIO_PORT_H)
        #define ETH_MII_COL_PIN         (GPIO_PIN_03)
        #define ETH_MII_COL_FUNC        (GPIO_FUNC_11)
    #endif
#endif

/************************ NAND port **********************/
#if defined(BSP_USING_NAND)
    #define NAND_CE_PORT                    (GPIO_PORT_D)   /* PD07 - EXMC_SMC_NFC_CS0 */
    #define NAND_CE_PIN                     (GPIO_PIN_07)
    #define NAND_CE_FUNC                    (GPIO_FUNC_21)

    #define NAND_RE_PORT                    (GPIO_PORT_D)   /* PD04 - EXMC_SMC_OE_NFC_RE */
    #define NAND_RE_PIN                     (GPIO_PIN_04)
    #define NAND_RE_FUNC                    (GPIO_FUNC_21)

    #define NAND_WE_PORT                    (GPIO_PORT_D)   /* PD05 - EXMC_SMC_NFC_WE */
    #define NAND_WE_PIN                     (GPIO_PIN_05)
    #define NAND_WE_FUNC                    (GPIO_FUNC_21)

    #define NAND_CLE_PORT                   (GPIO_PORT_D)   /* PD11 - EXMC_ADD16_DMC_BA0_NFC_CLE */
    #define NAND_CLE_PIN                    (GPIO_PIN_11)
    #define NAND_CLE_FUNC                   (GPIO_FUNC_21)

    #define NAND_ALE_PORT                   (GPIO_PORT_D)   /*  PD12 - EXMC_ADD17_DMC_BA1_NFC_ALE */
    #define NAND_ALE_PIN                    (GPIO_PIN_12)
    #define NAND_ALE_FUNC                   (GPIO_FUNC_21)

    #define NAND_WP_PORT                    (GPIO_PORT_G)   /* PG15 - EXMC_BAA */
    #define NAND_WP_PIN                     (GPIO_PIN_15)
    #define NAND_WP_FUNC                    (GPIO_FUNC_12)

    #define NAND_RB_PORT                    (GPIO_PORT_G)   /* PG06 - EXMC_RB0 */
    #define NAND_RB_PIN                     (GPIO_PIN_06)
    #define NAND_RB_FUNC                    (GPIO_FUNC_12)

    #define NAND_DATA0_PORT                 (GPIO_PORT_D)   /* PD14 - EXMC_DATA0 */
    #define NAND_DATA0_PIN                  (GPIO_PIN_14)
    #define NAND_DATA0_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA1_PORT                 (GPIO_PORT_D)   /* PD15 - EXMC_DATA1 */
    #define NAND_DATA1_PIN                  (GPIO_PIN_15)
    #define NAND_DATA1_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA2_PORT                 (GPIO_PORT_D)   /* PD0 - EXMC_DATA2 */
    #define NAND_DATA2_PIN                  (GPIO_PIN_00)
    #define NAND_DATA2_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA3_PORT                 (GPIO_PORT_D)   /* PD1 - EXMC_DATA3 */
    #define NAND_DATA3_PIN                  (GPIO_PIN_01)
    #define NAND_DATA3_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA4_PORT                 (GPIO_PORT_E)   /* PE7 - EXMC_DATA4 */
    #define NAND_DATA4_PIN                  (GPIO_PIN_07)
    #define NAND_DATA4_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA5_PORT                 (GPIO_PORT_E)   /* PE8 - EXMC_DATA5 */
    #define NAND_DATA5_PIN                  (GPIO_PIN_08)
    #define NAND_DATA5_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA6_PORT                 (GPIO_PORT_E)   /* PE9 - EXMC_DATA6 */
    #define NAND_DATA6_PIN                  (GPIO_PIN_09)
    #define NAND_DATA6_FUNC                 (GPIO_FUNC_12)
    #define NAND_DATA7_PORT                 (GPIO_PORT_E)   /* PE10 - EXMC_DATA7 */
    #define NAND_DATA7_PIN                  (GPIO_PIN_10)
    #define NAND_DATA7_FUNC                 (GPIO_FUNC_12)
#endif

/************************ SDIOC port **********************/
#if defined(BSP_USING_SDIO1)
    #define SDIOC1_CK_PORT                  (GPIO_PORT_C)
    #define SDIOC1_CK_PIN                   (GPIO_PIN_12)
    #define SDIOC1_CK_FUNC                  (GPIO_FUNC_9)

    #define SDIOC1_CMD_PORT                 (GPIO_PORT_D)
    #define SDIOC1_CMD_PIN                  (GPIO_PIN_02)
    #define SDIOC1_CMD_FUNC                 (GPIO_FUNC_9)

    #define SDIOC1_D0_PORT                  (GPIO_PORT_B)
    #define SDIOC1_D0_PIN                   (GPIO_PIN_07)
    #define SDIOC1_D0_FUNC                  (GPIO_FUNC_9)

    #define SDIOC1_D1_PORT                  (GPIO_PORT_A)
    #define SDIOC1_D1_PIN                   (GPIO_PIN_08)
    #define SDIOC1_D1_FUNC                  (GPIO_FUNC_9)

