RT-Thread/rt-thread/bsp/hc32/ev_hc32f4a8_lqfp176/board/board_config.h
/************************ RTC/PM *****************************/
#if defined(BSP_USING_RTC) || defined(RT_USING_PM)
    #if defined(BSP_RTC_USING_XTAL32) || defined(RT_USING_PM)
        #define XTAL32_PORT                     (GPIO_PORT_C)
        #define XTAL32_IN_PIN                   (GPIO_PIN_15)
        #define XTAL32_OUT_PIN                  (GPIO_PIN_14)
    #endif
#endif

#if defined(RT_USING_PWM)
    /***********  PWM_TMRA configure *********/
    #if defined(BSP_USING_PWM_TMRA_1)
        #if defined(BSP_USING_PWM_TMRA_1_CH1)
            #define PWM_TMRA_1_CH1_PORT             (GPIO_PORT_A)
            #define PWM_TMRA_1_CH1_PIN              (GPIO_PIN_08)
            #define PWM_TMRA_1_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TMRA_1_CH2)
            #define PWM_TMRA_1_CH2_PORT             (GPIO_PORT_A)
            #define PWM_TMRA_1_CH2_PIN              (GPIO_PIN_09)
            #define PWM_TMRA_1_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TMRA_1_CH3)
            #define PWM_TMRA_1_CH3_PORT             (GPIO_PORT_A)
            #define PWM_TMRA_1_CH3_PIN              (GPIO_PIN_10)
            #define PWM_TMRA_1_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TMRA_1_CH4)
            #define PWM_TMRA_1_CH4_PORT             (GPIO_PORT_A)
            #define PWM_TMRA_1_CH4_PIN              (GPIO_PIN_11)
            #define PWM_TMRA_1_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    /***********  PWM_TMR4 configure *********/
    #if defined(BSP_USING_PWM_TMR4_1)
        #if defined(BSP_USING_PWM_TMR4_1_OUH)
            #define PWM_TMR4_1_OUH_PORT             (GPIO_PORT_E)
            #define PWM_TMR4_1_OUH_PIN              (GPIO_PIN_09)
            #define PWM_TMR4_1_OUH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TMR4_1_OUL)
            #define PWM_TMR4_1_OUL_PORT             (GPIO_PORT_E)
            #define PWM_TMR4_1_OUL_PIN              (GPIO_PIN_08)
            #define PWM_TMR4_1_OUL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TMR4_1_OVH)
            #define PWM_TMR4_1_OVH_PORT             (GPIO_PORT_E)
            #define PWM_TMR4_1_OVH_PIN              (GPIO_PIN_11)
            #define PWM_TMR4_1_OVH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TMR4_1_OVL)
            #define PWM_TMR4_1_OVL_PORT             (GPIO_PORT_E)
            #define PWM_TMR4_1_OVL_PIN              (GPIO_PIN_10)
            #define PWM_TMR4_1_OVL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TMR4_1_OWH)
            #define PWM_TMR4_1_OWH_PORT             (GPIO_PORT_E)
            #define PWM_TMR4_1_OWH_PIN              (GPIO_PIN_13)
            #define PWM_TMR4_1_OWH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TMR4_1_OWL)
            #define PWM_TMR4_1_OWL_PORT             (GPIO_PORT_E)
            #define PWM_TMR4_1_OWL_PIN              (GPIO_PIN_12)
            #define PWM_TMR4_1_OWL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
    #endif

    /***********  PWM_TMR6 configure *********/
    #if defined(BSP_USING_PWM_TMR6_1)
        #if defined(BSP_USING_PWM_TMR6_1_A)
            #define PWM_TMR6_1_A_PORT               (GPIO_PORT_F)
            #define PWM_TMR6_1_A_PIN                (GPIO_PIN_13)
            #define PWM_TMR6_1_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TMR6_1_B)
            #define PWM_TMR6_1_B_PORT               (GPIO_PORT_F)
            #define PWM_TMR6_1_B_PIN                (GPIO_PIN_14)
            #define PWM_TMR6_1_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif

#endif

#if defined(BSP_USING_INPUT_CAPTURE)
    #define INPUT_CAPTURE_TMR6_FUNC                 (GPIO_FUNC_3)
    #if defined(BSP_USING_INPUT_CAPTURE_TMR6_1)
        #define INPUT_CAPTURE_TMR6_1_PORT           (GPIO_PORT_B)
        #define INPUT_CAPTURE_TMR6_1_PIN            (GPIO_PIN_09)
    #endif
    #if defined(BSP_USING_INPUT_CAPTURE_TMR6_2)
        #define INPUT_CAPTURE_TMR6_2_PORT           (GPIO_PORT_E)
        #define INPUT_CAPTURE_TMR6_2_PIN            (GPIO_PIN_07)
    #endif
    #if defined(BSP_USING_INPUT_CAPTURE_TMR6_3)
        #define INPUT_CAPTURE_TMR6_3_PORT           (GPIO_PORT_A)
        #define INPUT_CAPTURE_TMR6_3_PIN            (GPIO_PIN_00)
    #endif
#endif

#if defined(BSP_USING_USBD) || defined(BSP_USING_USBH)
    #if defined(BSP_USING_USBFS)
        /* USBFS Core*/
        #define USBF_DP_PORT                    (GPIO_PORT_A)
        #define USBF_DP_PIN                     (GPIO_PIN_12)
        #define USBF_DM_PORT                    (GPIO_PORT_A)
        #define USBF_DM_PIN                     (GPIO_PIN_11)
        #define USBF_VBUS_PORT                  (GPIO_PORT_A)
        #define USBF_VBUS_PIN                   (GPIO_PIN_09)
        #define USBF_VBUS_FUNC                  (GPIO_FUNC_10)
        #define USBF_DRVVBUS_PORT               (GPIO_PORT_C)
        #define USBF_DRVVBUS_PIN                (GPIO_PIN_09)
        #define USBF_DRVVBUS_FUNC               (GPIO_FUNC_10)
    #endif
    #if defined(BSP_USING_USBHS)
        /* USBHS Core*/
        #if defined(BSP_USING_USBHS_PHY_EMBED)
            #define USBH_DP_PORT                    (GPIO_PORT_B)
            #define USBH_DP_PIN                     (GPIO_PIN_15)
            #define USBH_DP_FUNC                    (GPIO_FUNC_10)
            #define USBH_DM_PORT                    (GPIO_PORT_B)
            #define USBH_DM_PIN                     (GPIO_PIN_14)
            #define USBH_DM_FUNC                    (GPIO_FUNC_10)
            #define USBH_VBUS_PORT                  (GPIO_PORT_B)
            #define USBH_VBUS_PIN                   (GPIO_PIN_13)
            #define USBH_VBUS_FUNC                  (GPIO_FUNC_12)
            #define USBH_DRVVBUS_PORT               (GPIO_PORT_B)
            #define USBH_DRVVBUS_PIN                (GPIO_PIN_11)
            #define USBH_DRVVBUS_FUNC               (GPIO_FUNC_10)
        #else
            /* USBHS Core, external PHY */
            #define USBH_ULPI_CLK_PORT              (GPIO_PORT_E)
            #define USBH_ULPI_CLK_PIN               (GPIO_PIN_12)
            #define USBH_ULPI_CLK_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_DIR_PORT              (GPIO_PORT_C)
            #define USBH_ULPI_DIR_PIN               (GPIO_PIN_02)
            #define USBH_ULPI_DIR_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_NXT_PORT              (GPIO_PORT_C)
            #define USBH_ULPI_NXT_PIN               (GPIO_PIN_03)
            #define USBH_ULPI_NXT_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_STP_PORT              (GPIO_PORT_C)
            #define USBH_ULPI_STP_PIN               (GPIO_PIN_00)
            #define USBH_ULPI_STP_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_D0_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D0_PIN                (GPIO_PIN_13)
            #define USBH_ULPI_D0_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D1_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D1_PIN                (GPIO_PIN_14)
            #define USBH_ULPI_D1_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D2_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D2_PIN                (GPIO_PIN_15)
            #define USBH_ULPI_D2_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D3_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D3_PIN                (GPIO_PIN_10)
            #define USBH_ULPI_D3_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D4_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D4_PIN                (GPIO_PIN_11)
            #define USBH_ULPI_D4_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D5_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D5_PIN                (GPIO_PIN_12)
            #define USBH_ULPI_D5_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D6_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D6_PIN                (GPIO_PIN_13)
            #define USBH_ULPI_D6_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D7_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D7_PIN                (GPIO_PIN_11)
            #define USBH_ULPI_D7_FUNC               (GPIO_FUNC_10)
            /* 3300 reset */
            #define USB_3300_RESET_PORT             (EIO_PORT1)
            #define USB_3300_RESET_PIN              (EIO_USB3300_RST)
        #endif
    #endif
#endif

#if defined(BSP_USING_QSPI)
    #ifndef BSP_QSPI_USING_SOFT_CS
        /* QSSN */
        #define QSPI_FLASH_CS_PORT              (GPIO_PORT_C)
        #define QSPI_FLASH_CS_PIN               (GPIO_PIN_07)
        #define QSPI_FLASH_CS_FUNC              (GPIO_FUNC_18)
    #endif
    /* QSCK */
    #define QSPI_FLASH_SCK_PORT             (GPIO_PORT_C)
    #define QSPI_FLASH_SCK_PIN              (GPIO_PIN_06)
    #define QSPI_FLASH_SCK_FUNC             (GPIO_FUNC_18)
    /* QSIO0 */
    #define QSPI_FLASH_IO0_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO0_PIN              (GPIO_PIN_13)
    #define QSPI_FLASH_IO0_FUNC             (GPIO_FUNC_18)
    /* QSIO1 */
    #define QSPI_FLASH_IO1_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO1_PIN              (GPIO_PIN_12)
    #define QSPI_FLASH_IO1_FUNC             (GPIO_FUNC_18)
    /* QSIO2 */
    #define QSPI_FLASH_IO2_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO2_PIN              (GPIO_PIN_10)
    #define QSPI_FLASH_IO2_FUNC             (GPIO_FUNC_18)
    /* QSIO3 */
    #define QSPI_FLASH_IO3_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO3_PIN              (GPIO_PIN_02)
    #define QSPI_FLASH_IO3_FUNC             (GPIO_FUNC_18)
#endif

/*********** TMRA_PULSE_ENCODER configure *********/
#if defined(RT_USING_PULSE_ENCODER)
    #if defined(BSP_USING_TMRA_PULSE_ENCODER)
        #if defined(BSP_USING_PULSE_ENCODER_TMRA_1)
            #define PULSE_ENCODER_TMRA_1_A_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TMRA_1_A_PIN       (GPIO_PIN_08)
            #define PULSE_ENCODER_TMRA_1_A_PIN_FUNC  (GPIO_FUNC_4)
            #define PULSE_ENCODER_TMRA_1_B_PORT      (GPIO_PORT_A)
            #define PULSE_ENCODER_TMRA_1_B_PIN       (GPIO_PIN_09)
            #define PULSE_ENCODER_TMRA_1_B_PIN_FUNC  (GPIO_FUNC_4)
        #endif /* BSP_USING_PULSE_ENCODER_TMRA_1 */
    #endif /* BSP_USING_TMRA_PULSE_ENCODER */

    #if defined(BSP_USING_TMR6_PULSE_ENCODER)
        #if defined(BSP_USING_PULSE_ENCODER_TMR6_1)
            #define PULSE_ENCODER_TMR6_1_A_PORT      (GPIO_PORT_B)
            #define PULSE_ENCODER_TMR6_1_A_PIN       (GPIO_PIN_09)
            #define PULSE_ENCODER_TMR6_1_A_PIN_FUNC  (GPIO_FUNC_3)
            #define PULSE_ENCODER_TMR6_1_B_PORT      (GPIO_PORT_B)
            #define PULSE_ENCODER_TMR6_1_B_PIN       (GPIO_PIN_08)
            #define PULSE_ENCODER_TMR6_1_B_PIN_FUNC  (GPIO_FUNC_3)
        #endif /* BSP_USING_PULSE_ENCODER_TMR6_1 */
    #endif /* BSP_USING_TMR6_PULSE_ENCODER */
#endif /* RT_USING_PULSE_ENCODER */

#endif

